Revit 2027 API
ParameterTypeId.RbsConduitDiameterParam Property
 "Diameter(Trade Size)"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RbsConduitDiameterParam { get; }
Public Shared ReadOnly Property RbsConduitDiameterParam As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RbsConduitDiameterParam {
	ForgeTypeId^ get ();
}
static member RbsConduitDiameterParam : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace